9/data/attachments/6316ba5d2418032d.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_e14a244b-93c0-48b8-8d81-c113e96e4042</nif:username>
            <nif:friendToBeAdded>Luke_clearly_Friend_28388_3</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>